bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/mipi_reg.h
/* 0xFC : dummy_reg */
#define MIPI_DUMMY_REG_OFFSET                                   (0xFC)
#define MIPI_DUMMY_REG                                          MIPI_DUMMY_REG
#define MIPI_DUMMY_REG_POS                                      (0U)
#define MIPI_DUMMY_REG_LEN                                      (32U)
#define MIPI_DUMMY_REG_MSK                                      (((1U<<MIPI_DUMMY_REG_LEN)-1)<<MIPI_DUMMY_REG_POS)
#define MIPI_DUMMY_REG_UMSK                                     (~(((1U<<MIPI_DUMMY_REG_LEN)-1)<<MIPI_DUMMY_REG_POS))


struct  mipi_reg {
    /* 0x0 : mipi_config */
    union {
        struct {
            uint32_t cr_mipi_en                     :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_lane_num                    :  1; /* [    1],        r/w,        0x1 */
            uint32_t rsvd_2                         :  1; /* [    2],       rsvd,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t cr_data_bit_inv                :  1; /* [    4],        r/w,        0x0 */
            uint32_t cr_sync_sp_en                  :  1; /* [    5],        r/w,        0x0 */
            uint32_t cr_unpack_en                   :  1; /* [    6],        r/w,        0x1 */
            uint32_t reserved_7_11                  :  5; /* [11: 7],       rsvd,        0x0 */
            uint32_t cr_vc_dvp0                     :  2; /* [13:12],        r/w,        0x0 */
            uint32_t cr_vc_dvp1                     :  2; /* [15:14],        r/w,        0x1 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mipi_config;

    /* 0x4 : mipi_int_status */
    union {
        struct {
            uint32_t mipi_int_status                :  4; /* [ 3: 0],          r,        0x0 */
            uint32_t reserved_4_31                  : 28; /* [31: 4],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mipi_int_status;

    /* 0x8 : mipi_int_mask */
    union {
        struct {
            uint32_t mipi_int_mask                  :  4; /* [ 3: 0],        r/w,        0xf */
            uint32_t reserved_4_31                  : 28; /* [31: 4],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mipi_int_mask;

    /* 0xC : mipi_int_clear */
    union {
        struct {
            uint32_t mipi_int_clear                 :  4; /* [ 3: 0],        w1c,        0x0 */
            uint32_t reserved_4_31                  : 28; /* [31: 4],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mipi_int_clear;

    /* 0x10  reserved */
    uint8_t RESERVED0x10[16];

    /* 0x20 : gnr_buf_status */
    union {
        struct {
            uint32_t st_gnr_fifo_cnt                :  4; /* [ 3: 0],          r,        0x0 */
            uint32_t reserved_4_31                  : 28; /* [31: 4],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gnr_buf_status;

    /* 0x24 : gnr_buf_rdata */
    union {
        struct {
            uint32_t gnr_buf_rdata                  : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } gnr_buf_rdata;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[88];

    /* 0x80 : dphy_config_0 */
    union {
        struct {
            uint32_t dl0_enable                     :  1; /* [    0],        r/w,        0x0 */
            uint32_t dl1_enable                     :  1; /* [    1],        r/w,        0x0 */
            uint32_t cl_enable                      :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t dl0_stopstate                  :  1; /* [    4],          r,        0x1 */
            uint32_t dl1_stopstate                  :  1; /* [    5],          r,        0x1 */
            uint32_t cl_stopstate                   :  1; /* [    6],          r,        0x1 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t dl0_ulpsactivenot              :  1; /* [    8],          r,        0x1 */
            uint32_t dl1_ulpsactivenot              :  1; /* [    9],          r,        0x1 */
            uint32_t cl_ulpsactivenot               :  1; /* [   10],          r,        0x1 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t dl0_forcerxmode                :  1; /* [   12],        r/w,        0x0 */
            uint32_t dl1_forcerxmode                :  1; /* [   13],        r/w,        0x0 */
            uint32_t cl_rxclkactivehs               :  1; /* [   14],          r,        0x0 */
            uint32_t cl_rxulpsclknot                :  1; /* [   15],          r,        0x1 */
            uint32_t reserved_16_30                 : 15; /* [30:16],       rsvd,        0x0 */
            uint32_t csi_reset_n                    :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } dphy_config_0;

    /* 0x84 : dphy_config_1 */
    union {
        struct {
            uint32_t reg_time_ck_settle             :  8; /* [ 7: 0],        r/w,        0xa */
            uint32_t reg_time_ck_term_en            :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_time_hs_settle             :  8; /* [23:16],        r/w,       0x30 */
            uint32_t reg_time_hs_term_en            :  8; /* [31:24],        r/w,       0x18 */
        }BF;
        uint32_t WORD;
    } dphy_config_1;

    /* 0x88 : dphy_config_2 */
    union {
        struct {
            uint32_t reg_ana_lprxen_clk             :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_ana_hsrxen_clk             :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_ana_hsrx_stop_state        :  2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_ana_hsrx_sync_en           :  2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reg_ana_lprxen                 :  2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t reg_ana_hsrxen                 :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_ana_term_en                :  5; /* [14:10],        r/w,        0x0 */
            uint32_t reg_ana_test_en                :  1; /* [   15],        r/w,        0x0 */
            uint32_t reg_pt_lock_counter            :  4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_pt_prbs_or_jitt            :  1; /* [   20],        r/w,        0x0 */
            uint32_t reg_pt_lp_mode                 :  1; /* [   21],        r/w,        0x0 */
            uint32_t reg_pt_en                      :  1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23_31                 :  9; /* [31:23],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dphy_config_2;

    /* 0x8C : dphy_config_3 */
    union {
        struct {
            uint32_t reg_csi_ana_1                  : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_csi_ana_0                  : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } dphy_config_3;

    /* 0x90  reserved */
    uint8_t RESERVED0x90[108];

    /* 0xFC : dummy_reg */
    union {
        struct {
            uint32_t dummy_reg                      : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } dummy_reg;

};

typedef volatile struct mipi_reg mipi_reg_t;


#endif  /* __MIPI_REG_H__ */
